_Rarzrabotki/Kazna/InformationRegisters/ОпределениеВизирующих_Удалить.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОпределениеВизирующих_Удалить</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/ОпределениеВизирующих_Удалить/Ext/ManagerModule.bsl
Функция ПолучитьМассивВизерей( пПараметры ) Экспорт 
	
	лПодразделение	= Неопределено;
	лОрганизация    = Неопределено;
	лВидОплаты      = Неопределено;
	лСтатьяДДС		= Неопределено;
	лСумма          = Неопределено;
	
	пПараметры.Свойство("Подразделение", 	лПодразделение);
	пПараметры.Свойство("Организация", 		лОрганизация);
	пПараметры.Свойство("ВидОплаты", 		лВидОплаты);
	пПараметры.Свойство("Сумма", 			лСумма);
	Если НЕ пПараметры.Свойство("СтатьяДДС", лСтатьяДДС) Тогда 
		пПараметры.Свойство("СтатьяДвиженияДенежныхСредств", лСтатьяДДС);
	КонецЕсли;
	
	лПодразделение = ?(Не ЗначениеЗаполнено(лПодразделение), Справочники.Подразделения.ПустаяСсылка(), лПодразделение);
	лПодразделения = Новый Массив();
	Пока ЗначениеЗаполнено(лПодразделение) Цикл 
		лПодразделения.Добавить(лПодразделение);
		лПодразделение = лПодразделение.Родитель;
	КонецЦикла;
	
	лСтатьиДДС 		= Новый Массив();
	Пока ЗначениеЗаполнено(лСтатьяДДС) Цикл 
		лСтатьиДДС.Добавить(лСтатьяДДС);
		лСтатьяДДС 		= лСтатьяДДС.Родитель;
	КонецЦикла;
	
	лСумма	=?(лСумма = Неопределено, -1, 	лСумма);
	
	лЗапрос 		= Новый Запрос();
	
	лЗапрос.Текст 	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	              	  |	Т.Роль,
	              	  |	Т.Роль.Приоритет КАК Приоритет
	              	  |ИЗ
	              	  |	РегистрСведений.ОпределениеВизирующих КАК Т
	              	  |ГДЕ
	              	  |	(Т.Подразделение В (&Подразделения)
	              	  |			ИЛИ Т.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
	              	  |	И (Т.Организация = &Организация
	              	  |			ИЛИ Т.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	              	  |	И (Т.ВидОплаты = &ВидОплаты
	              	  |			ИЛИ Т.ВидОплаты = ЗНАЧЕНИЕ(перечисление.ВидыДенежныхСредств.ПустаяСсылка))
	              	  |	И (Т.СтатьяДвиженияДенежныхСредств В (&СтатьиДДС)
	              	  |			ИЛИ Т.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка))
	              	  |	И (Т.Сумма <= &Сумма
	              	  |			ИЛИ Т.Сумма = 0)
	              	  |
	              	  |УПОРЯДОЧИТЬ ПО
	              	  |	Приоритет УБЫВ";
					  
 	лЗапрос.УстановитьПараметр("Подразделения", лПодразделения);
 	лЗапрос.УстановитьПараметр("Организация", 	лОрганизация);
 	лЗапрос.УстановитьПараметр("ВидОплаты", 	лВидОплаты);
 	лЗапрос.УстановитьПараметр("СтатьиДДС",		лСтатьиДДС);
	лЗапрос.УстановитьПараметр("Сумма",			лСумма);
	
	лТЗ = лЗапрос.Выполнить().Выгрузить();
	Возврат лТЗ.ВыгрузитьКолонку("Роль");

КонецФункции
